Revit 2027 API
ParameterTypeId.ViewDependency Property
 "Dependency"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewDependency { get; }
Public Shared ReadOnly Property ViewDependency As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewDependency {
	ForgeTypeId^ get ();
}
static member ViewDependency : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace